kingovchouffe/Chorus_CH32/SW/ch32fun_chorus_/src/main.c

/* 13/03/2025
CHorus32 is a chorus guitar pedal effect based on the 20cts ch32v003 uC
@kingovchouffe
*/
#include "ch32fun.h"
#include <stdio.h>
#include <math.h>

#define InputPin PC4
#define RATE_POT gpio_ain
#define OutputPin PC0
#define PWM_CHANNEL 3
#define SAMPLE_RATE 97700
#define MAX_DELAY_MS 25   // Délai maximal en ms
#define LFO_FREQUENCY 0.5 // Fréquence du LFO en Hz
#define DEPTH_MS 10       // Profondeur de modulation en ms
#define TWO_PI 6.28318530718

#define BUFFER_LENGTH 256
volatile uint16_t buffer[BUFFER_LENGTH] = {0};
volatile uint16_t delay_buffer[BUFFER_LENGTH] = {0};
// void DMA1_Channel1_IRQHandler(void) __attribute__((interrupt));

void process_audio_dma(void)
{
    static int sample_count = 0;
    // Lecture de l'ADC (valeur 12 bits)
    for (int i = 0; i < BUFFER_LENGTH; i++)
    {
        // Génération du LFO sinusoïdal

        float lfo_value = sinf(TWO_PI * LFO_FREQUENCY * sample_count / SAMPLE_RATE);
        sample_count++;

        // Calcul du retard dynamique
        int max_delay_samples = (SAMPLE_RATE * MAX_DELAY_MS) / 1000;
        int depth_samples = (SAMPLE_RATE * DEPTH_MS) / 1000;
        int delay_samples = max_delay_samples / 2 + (int)(depth_samples * lfo_value);
        int read_index = i - delay_samples;
        if (read_index < 0)
            read_index += BUFFER_LENGTH;

        // Sauvegarde du signal actuel dans le buffer circulaire
        delay_buffer[i] = buffer[read_index];
    }
}
// Instanciate dma copy to adc_buffer from adc HW
void init_dma_adc()
{
    // Start DMA clock
    RCC->AHBPCENR |= RCC_AHBPeriph_DMA1;

    // Setup DMA Channel 1 (adc triggered) as reading, 16-bit, linear buffer
    DMA1_Channel1->CFGR =
        DMA_CFGR1_MINC |                       // Incrémentation mémoire
        DMA_CFGR1_CIRC |                       // Mode circulaire
        DMA_CFGR1_PL_1 |                       // Priorité haute
        DMA_CFGR1_PSIZE_0 | DMA_CFGR1_MSIZE_0; // 16 bits

    // No of samples to get before irq
    DMA1_Channel1->CNTR = BUFFER_LENGTH;
    // Source
    DMA1_Channel1->PADDR = (uint32_t)&ADC1->RDATAR;
    // Destination
    DMA1_Channel1->MADDR = (uint32_t)buffer;

    // Enable IRQ and DMA channel
    NVIC_EnableIRQ(DMA1_Channel1_IRQn);
    DMA1_Channel1->CFGR |= DMA_IT_TC | DMA_CFGR1_EN;
}

// Instanciate dma copy to PWM register from adc buffer
void init_dma_copy_to_pwm()
{
    DMA1_Channel2->CFGR =
        DMA_CFGR2_MINC |                       // Incrémentation mémoire
        DMA_CFGR2_CIRC |                       // Mode circulaire
        DMA_CFGR2_PL_1 |                       // Priorité haute
        DMA_CFGR2_DIR |                        // memory to peripherals
        DMA_CFGR2_PSIZE_0 | DMA_CFGR2_MSIZE_0; // 16 bits
    // No of samples to get before irq
    DMA1_Channel2->CNTR = BUFFER_LENGTH;
    // Source
    DMA1_Channel2->MADDR = (uint32_t)delay_buffer;

    // Destination to PWM register
    DMA1_Channel2->PADDR = (uint32_t)&TIM2->CH3CVR;

    // Enable IRQ and DMA channel
    // DMA1_Channel2->CFGR |= DMA_CFGR1_TCIE;
    NVIC_EnableIRQ(DMA1_Channel2_IRQn);
    DMA1_Channel2->CFGR |= DMA_IT_TC | DMA_CFGR2_EN;
}
void init_timer2()
{
    // Enable TIM2
    RCC->APB1PCENR |= RCC_APB1Periph_TIM2;
    printf("Initializing timer2...\r\n");
    // using T2CH3 must also enable GPIOC
    RCC->APB2PCENR |= RCC_APB2Periph_GPIOC;

    // PC0 is T2CH3, 10MHz Output alt func, push-pull
    GPIOC->CFGLR &= ~(0xf << (4 * 0));
    GPIOC->CFGLR |= (GPIO_Speed_2MHz | GPIO_CNF_OUT_PP_AF) << (4 * 0);

    // Reset TIM2 to init all regs
    RCC->APB1PRSTR |= RCC_APB1Periph_TIM2;
    RCC->APB1PRSTR &= ~RCC_APB1Periph_TIM2;

    // SMCFGR: default clk input is CK_INT
    // set TIM2 clock prescaler divider
    TIM2->PSC = 0x000;
    // set PWM total cycle width
    TIM2->ATRLR = 500 - 1;

    TIM2->CHCTLR2 |= TIM_OC3M_2 | TIM_OC3M_1 | TIM_OC3PE;

    // CTLR1: default is up, events generated, edge align
    // enable auto-reload of preload
    TIM2->CTLR1 |= TIM_ARPE;
    TIM2->CTLR1 &= ~TIM_OPM;

    // Enable Channel outputs, set default state (based on TIM2_DEFAULT)
    TIM2->CCER |= TIM_CC3E | (TIM_CC3P & 0xff);
    // initialize counter

    // Enable DMA triggering
    TIM2->DMAINTENR |= TIM_TDE;
    TIM2->DMAINTENR |= TIM_UDE;
    // TIM2->CH3CVR =255;
}

void init_timer1()
{
    // TIMER
    printf("Initializing timer1...\r\n");
    RCC->APB2PCENR |= RCC_APB2Periph_TIM1;
    TIM1->CTLR1 |= TIM_CounterMode_Up | TIM_CKD_DIV1;
    TIM1->CTLR2 = TIM_MMS_1;
    TIM1->ATRLR = 500 - 1; // Foutput=(48MHz)/(PSC-1)(ARR+1)
    TIM1->PSC = 0;
    // TIM1->RPTCR = 0;
    // TIM1->SWEVGR = TIM_PSCReloadMode_Immediate;
    NVIC_EnableIRQ(TIM1_UP_IRQn);
    TIM1->INTFR = ~TIM_FLAG_Update;
    // TIM1->DMAINTENR |= TIM_IT_Update;
    TIM1->BDTR |= TIM_MOE;
    TIM1->DMAINTENR |= TIM_TDE;
    TIM1->DMAINTENR = TIM_UDE;

    init_timer2();
    // Enable TIM
    TIM2->CTLR1 |= TIM_CEN;
    TIM1->CTLR1 |= TIM_CEN;
}

void init_adc()
{
    // to be changed to PD4 for the input PD5 for rate pot and PD6 for the depth
    RCC->APB2PCENR |= RCC_APB2Periph_GPIOC;
    GPIOC->CFGLR &= ~(0xf << (4 * 4)); // CNF = 00: Analog, MODE = 00: Input

    RCC->APB2PCENR |= RCC_APB2Periph_ADC1;

    // Reset the ADC to init all regs
    RCC->APB2PRSTR |= RCC_APB2Periph_ADC1;
    RCC->APB2PRSTR &= ~RCC_APB2Periph_ADC1;

    // ADCCLK = 24 MHz => RCC_ADCPRE divide by 2
    RCC->CFGR0 &= ~RCC_ADCPRE;     // Clear out the bis in case they were set
    RCC->CFGR0 |= RCC_ADCPRE_DIV2; // set it to 010xx for /2.

    // Keep CALVOL register with initial value
    ADC1->CTLR2 = ADC_ADON | ADC_DMA | ADC_EXTTRIG | ADC_ExternalTrigConv_T1_TRGO;

    // Possible times: 0->3,1->9,2->15,3->30,4->43,5->57,6->73,7->241 cycles
    ADC1->SAMPTR2 = 7 /*3 cycles*/ << (3 /*offset per channel*/ * 1 /*channel*/);

    // Set sequencer to channel 2 only
    ADC1->RSQR3 = 2;

    // Calibrate
    ADC1->CTLR2 |= ADC_RSTCAL;
    while (ADC1->CTLR2 & ADC_RSTCAL)
        ;

    ADC1->CTLR2 |= ADC_CAL;
    while (ADC1->CTLR2 & ADC_CAL)
        ;

    ADC1->RDATAR; // wake up the dma
    NVIC_EnableIRQ(ADC_IRQn);
    printf("Initialized adc...\r\n");
}

void DMA1_Channel1_IRQHandler(void) __attribute__((interrupt()));
void DMA1_Channel1_IRQHandler()
{
    //printf("dma chan1 irq\r\n");
    // DMA complete ?
    if (DMA1->INTFR & DMA1_FLAG_TC1)
    {
        DMA1->INTFCR = DMA_CTCIF1;
        process_audio_dma();
        // rearmed dma
        init_dma_adc();
    }
}

void ADC1_IRQHandler(void) __attribute__((interrupt()));
void ADC1_IRQHandler()
{
    if (ADC1->STATR & ADC_FLAG_EOC)
    {
        ADC1->STATR = ~ADC_FLAG_EOC;
        //printf("ADC ISR! \r\n");
    }
}

int main(void)
{
    SystemInit();

    // while( !DebugPrintfBufferFree() );

    init_adc();
    init_dma_adc();
    init_timer1();
    init_dma_copy_to_pwm();
    while (1)
    {
    }
}
